apache/nuttx/arch/arm/src/stm32f7/stm32_can_sock.c
static int stm32can_rx0interrupt(int irq, void *context, void *arg)
{
  struct stm32_can_s *priv = (struct stm32_can_s *)arg;
  return stm32can_rxinterrupt(priv, 0);
}

/****************************************************************************
 * Name: stm32can_rx1interrupt
 *
 * Description:
 *   CAN RX FIFO 1 interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int stm32can_rx1interrupt(int irq, void *context, void *arg)
{
  struct stm32_can_s *priv = (struct stm32_can_s *)arg;
  return stm32can_rxinterrupt(priv, 1);
}

/****************************************************************************
 * Name: stm32can_txinterrupt
 *
 * Description:
 *   CAN TX mailbox complete interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int stm32can_txinterrupt(int irq, void *context, void *arg)
{
  struct stm32_can_s *priv = (struct stm32_can_s *)arg;
  uint32_t regval;

  DEBUGASSERT(priv != NULL);

  /* Get the transmit status */

  regval = stm32can_getreg(priv, STM32_CAN_TSR_OFFSET);

  /* Check for RQCP0: Request completed mailbox 0 */

  if ((regval & CAN_TSR_RQCP0) != 0)
    {
      /* Writing '1' to RCP0 clears RCP0 and all the status bits (TXOK0,
       * ALST0 and TERR0) for Mailbox 0.
       */

      stm32can_putreg(priv, STM32_CAN_TSR_OFFSET, CAN_TSR_RQCP0);

      /* Tell the upper half that the transfer is finished. */

      /* Disable further TX CAN interrupts. here can be no race
       * condition here.
       */

      stm32can_txint(priv, false);
      work_queue(CANWORK, &priv->irqwork, stm32can_txdone_work, priv, 0);
    }

  /* Check for RQCP1: Request completed mailbox 1 */

  if ((regval & CAN_TSR_RQCP1) != 0)
    {
      /* Writing '1' to RCP1 clears RCP1 and all the status bits (TXOK1,
       * ALST1 and TERR1) for Mailbox 1.
       */

      stm32can_putreg(priv, STM32_CAN_TSR_OFFSET, CAN_TSR_RQCP1);

      /* Tell the upper half that the transfer is finished. */

      /* Disable further TX CAN interrupts. here can be no race
       * condition here.
       */

      stm32can_txint(priv, false);
      work_queue(CANWORK, &priv->irqwork, stm32can_txdone_work, priv, 0);
    }

  /* Check for RQCP2: Request completed mailbox 2 */

  if ((regval & CAN_TSR_RQCP2) != 0)
    {
      /* Writing '1' to RCP2 clears RCP2 and all the status bits (TXOK2,
       * ALST2 and TERR2) for Mailbox 2.
       */

      stm32can_putreg(priv, STM32_CAN_TSR_OFFSET, CAN_TSR_RQCP2);

      /* Disable further TX CAN interrupts. here can be no race
       * condition here.
       */

      stm32can_txint(priv, false);
      work_queue(CANWORK, &priv->irqwork, stm32can_txdone_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: stm32can_txdone_work
 ****************************************************************************/

static void stm32can_txdone_work(void *arg)
{
  struct stm32_can_s *priv = (struct stm32_can_s *)arg;

  stm32can_txdone(priv);

  /* There should be space for a new TX in any event.  Poll the network for
   * new XMIT data
   */

  net_lock();
  devif_poll(&priv->dev, stm32can_txpoll);
  net_unlock();
}

/****************************************************************************
 * Name: stm32can_txdone
 ****************************************************************************/

static void stm32can_txdone(struct stm32_can_s *priv)
{
  stm32can_txint(priv, true);

  NETDEV_TXDONE(&priv->dev);
}

#ifdef CONFIG_NET_CAN_ERRORS

/****************************************************************************
 * Name: stm32can_sceinterrupt_work
 *
 * Description:
 *   CAN status change interrupt work
 *
 * Input Parameters:
 *   arg  - reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32can_sceinterrupt_work(void *arg)
{
  struct stm32_can_s *priv    = (struct stm32_can_s *)arg;
  struct can_frame   *frame   = (struct can_frame *)priv->rxdesc;
  uint32_t            regval  = 0;
  uint16_t            errbits = 0;
  uint8_t             data[CAN_ERR_DLC];

  DEBUGASSERT(priv != NULL);

  /* Check Error Interrupt flag */

  regval = stm32can_getreg(priv, STM32_CAN_MSR_OFFSET);
  if (regval & CAN_MSR_ERRI)
    {
      /* Encode error bits */

      errbits = 0;
      memset(data, 0, sizeof(data));

      /* Get Error statur register */

      regval = stm32can_getreg(priv, STM32_CAN_ESR_OFFSET);

      if (regval & CAN_ESR_EWGF)
        {
          /* Error warning flag */

          data[1] |= (CAN_ERR_CRTL_RX_WARNING | CAN_ERR_CRTL_TX_WARNING);
          errbits |= CAN_ERR_CRTL;
        }

      if (regval & CAN_ESR_EPVF)
        {
          /* Error passive flag */

          data[1] |= (CAN_ERR_CRTL_RX_PASSIVE | CAN_ERR_CRTL_TX_PASSIVE);
          errbits |= CAN_ERR_CRTL;
        }

      if (regval & CAN_ESR_BOFF)
        {
          /* Bus-off flag */

          errbits |= CAN_ERR_BUSOFF;
        }

      /* Last error code */

      if (regval & CAN_ESR_LEC_MASK)
        {
          if (regval & CAN_ESR_STUFFERROR)
            {
              /* Stuff Error */

              errbits |= CAN_ERR_PROT;
              data[2] |= CAN_ERR_PROT_STUFF;
            }
          else if (regval & CAN_ESR_FORMERROR)
            {
              /* Format Error */

              errbits |= CAN_ERR_PROT;
              data[2] |= CAN_ERR_PROT_FORM;
            }
          else if (regval & CAN_ESR_ACKERROR)
            {
              /* Acknowledge Error */

              errbits |= CAN_ERR_ACK;
            }
          else if (regval & CAN_ESR_BRECERROR)
            {
              /* Bit recessive Error */

